#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;       Use native low precision
;       Resource descriptor heap indexing
;       Wave Matrix
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 418357a1d7d40bfe87865ab33f58b614.pdb
; shader hash: 418357a1d7d40bfe87865ab33f58b614
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(256,1,1)
; WaveSize=32
;
;
; Buffer Definitions:
;
; cbuffer cb0
; {
;
;   struct cb0
;   {
;
;       uint4 DstRect;                                ; Offset:    0
;       float3 BrightPixelGain;                       ; Offset:   16
;       uint Width;                                   ; Offset:   28
;       uint Height;                                  ; Offset:   32
;       uint TransformType;                           ; Offset:   36
;       uint InputTextureOffset;                      ; Offset:   40
;       uint OutputTextureOffset;                     ; Offset:   44
;       uint DstPostFilterParaOffset;                 ; Offset:   48
;       uint FBufferOffset;                           ; Offset:   52
;       uint FBufferInverseOffset;                    ; Offset:   56

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.4 (3e105849c)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !42, globals: !141)
!1 = !DIFile(filename: "./FFT_TwoForOne.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !14, !22, !33, !26, !41}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 250, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 250, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 250, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 250, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t2", file: !1, line: 93, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 2>", file: !1, line: 93, size: 32, align: 16, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 93, baseType: !18, size: 16, align: 16, flags: DIFlagPublic)
!18 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 93, baseType: !18, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 129, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 128, size: 128, align: 32, elements: !24, templateParams: !30)
!24 = !{!25, !27, !28, !29}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 128, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 128, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 128, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !23, file: !1, line: 128, baseType: !26, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !{!31, !32}
!31 = !DITemplateTypeParameter(name: "element", type: !26)
!32 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 10, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 10, size: 96, align: 32, elements: !35, templateParams: !39)
!35 = !{!36, !37, !38}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, line: 10, baseType: !26, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, line: 10, baseType: !26, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !34, file: !1, line: 10, baseType: !26, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!39 = !{!31, !40}
!40 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!41 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t", file: !1, line: 248, baseType: !18)
!42 = !{!43, !54, !72, !75, !76, !81, !84, !87, !90, !96, !99, !102, !105, !108, !111, !114, !119, !122, !127, !130, !133, !134, !135, !136, !137, !138}
!43 = !DISubprogram(name: "CSMain", scope: !1, file: !1, line: 77, type: !44, isLocal: false, isDefinition: true, scopeLine: 82, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @CSMain)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !4, !46, !53}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 250, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 250, size: 96, align: 32, elements: !48, templateParams: !52)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !47, file: !1, line: 250, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !47, file: !1, line: 250, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !1, line: 250, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !{!11, !40}
!53 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 11, baseType: !8)
!54 = !DISubprogram(name: "CopyDataSrcWindowToLocal", linkageName: "\01?CopyDataSrcWindowToLocal@@YAXY117$$CAV?$vector@$f16@$01@@_NIIIV?$vector@I$03@@@Z", scope: !55, file: !55, line: 64, type: !56, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DIFile(filename: "./FFT_Common_Radix8.hlsl", directory: "")
!56 = !DISubroutineType(types: !57)
!57 = !{null, !58, !63, !53, !53, !53, !64}
!58 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !59)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 512, align: 16, elements: !60)
!60 = !{!61, !62}
!61 = !DISubrange(count: 2)
!62 = !DISubrange(count: 8)
!63 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!64 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 9, baseType: !65)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 9, size: 128, align: 32, elements: !66, templateParams: !71)
!66 = !{!67, !68, !69, !70}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !65, file: !1, line: 9, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !65, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !65, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !65, file: !1, line: 9, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!71 = !{!11, !32}
!72 = !DISubprogram(name: "ScrubNANs", linkageName: "\01?ScrubNANs@@YAXY117$$CAV?$vector@$f16@$01@@@Z", scope: !55, file: !55, line: 4, type: !73, isLocal: false, isDefinition: true, scopeLine: 5, flags: DIFlagPrototyped, isOptimized: false)
!73 = !DISubroutineType(types: !74)
!74 = !{null, !58}
!75 = !DISubprogram(name: "ModifyInput", linkageName: "\01?ModifyInput@@YAXY117$$CAV?$vector@$f16@$01@@@Z", scope: !1, file: !1, line: 58, type: !73, isLocal: false, isDefinition: true, scopeLine: 59, flags: DIFlagPrototyped, isOptimized: false)
!76 = !DISubprogram(name: "FilterPixel", linkageName: "\01?FilterPixel@@YA_NV?$vector@M$02@@AIAV?$vector@M$03@@@Z", scope: !1, file: !1, line: 42, type: !77, isLocal: false, isDefinition: true, scopeLine: 43, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubroutineType(types: !78)
!78 = !{!63, !33, !79}
!79 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !80)
!80 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !22)
!81 = !DISubprogram(name: "ConvertToLuma", linkageName: "\01?ConvertToLuma@@YAMV?$vector@M$02@@@Z", scope: !1, file: !1, line: 37, type: !82, isLocal: false, isDefinition: true, scopeLine: 38, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{!26, !33}
!84 = !DISubprogram(name: "ReadTwoForOneFrequencyData", linkageName: "\01?ReadTwoForOneFrequencyData@@YAX_NY117$$CAV?$vector@$f16@$01@@IIII@Z", scope: !55, file: !55, line: 732, type: !85, isLocal: false, isDefinition: true, scopeLine: 733, flags: DIFlagPrototyped, isOptimized: false)
!85 = !DISubroutineType(types: !86)
!86 = !{null, !63, !58, !53, !53, !53, !53}
!87 = !DISubprogram(name: "MergeTwoForOne", linkageName: "\01?MergeTwoForOne@@YAXY117$$CAV?$vector@$f16@$01@@III@Z", scope: !55, file: !55, line: 722, type: !88, isLocal: false, isDefinition: true, scopeLine: 723, flags: DIFlagPrototyped, isOptimized: false)
!88 = !DISubroutineType(types: !89)
!89 = !{null, !58, !53, !53, !53}
!90 = !DISubprogram(name: "MergeTwoForOne", linkageName: "\01?MergeTwoForOne@@YAXY07$$CAV?$vector@$f16@$01@@III@Z", scope: !55, file: !55, line: 649, type: !91, isLocal: false, isDefinition: true, scopeLine: 650, flags: DIFlagPrototyped, isOptimized: false)
!91 = !DISubroutineType(types: !92)
!92 = !{null, !93, !53, !53, !53}
!93 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !94)
!94 = !DICompositeType(tag: DW_TAG_array_type, baseType: !14, size: 256, align: 16, elements: !95)
!95 = !{!62}
!96 = !DISubprogram(name: "CopyLocalYToGroupShared", linkageName: "\01?CopyLocalYToGroupShared@@YAXY07V?$vector@$f16@$01@@II@Z", scope: !55, file: !55, line: 465, type: !97, isLocal: false, isDefinition: true, scopeLine: 466, flags: DIFlagPrototyped, isOptimized: false)
!97 = !DISubroutineType(types: !98)
!98 = !{null, !94, !53, !53}
!99 = !DISubprogram(name: "CopyLocalYToGroupShared", linkageName: "\01?CopyLocalYToGroupShared@@YAXY07V?$vector@$f16@$01@@III@Z", scope: !55, file: !55, line: 449, type: !100, isLocal: false, isDefinition: true, scopeLine: 450, flags: DIFlagPrototyped, isOptimized: false)
!100 = !DISubroutineType(types: !101)
!101 = !{null, !94, !53, !53, !53}
!102 = !DISubprogram(name: "ComplexMult", linkageName: "\01?ComplexMult@@YA?AV?$vector@$f16@$01@@V1@0@Z", scope: !55, file: !55, line: 152, type: !103, isLocal: false, isDefinition: true, scopeLine: 153, flags: DIFlagPrototyped, isOptimized: false)
!103 = !DISubroutineType(types: !104)
!104 = !{!14, !14, !14}
!105 = !DISubprogram(name: "GroupSharedTCFFT", linkageName: "\01?GroupSharedTCFFT@@YAX_NY117$$CAV?$vector@$f16@$01@@II@Z", scope: !55, file: !55, line: 402, type: !106, isLocal: false, isDefinition: true, scopeLine: 403, flags: DIFlagPrototyped, isOptimized: false)
!106 = !DISubroutineType(types: !107)
!107 = !{null, !63, !58, !53, !53}
