#if 0
;
; Note: shader requires additional functionality:
;       Wave level operations
;       Use native low precision
;       Resource descriptor heap indexing
;       Wave Matrix
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 381f60c1702251fd9f87040282cd48e3.pdb
; shader hash: 381f60c1702251fd9f87040282cd48e3
;
; Pipeline Runtime Information: 
;
; Compute Shader
; NumThreads=(128,1,1)
; WaveSize=32
;
;
; Buffer Definitions:
;
; cbuffer cb0
; {
;
;   struct cb0
;   {
;
;       uint2 SrcRectMax;                             ; Offset:    0
;       uint2 DstExtent;                              ; Offset:    8
;       uint TransformType;                           ; Offset:   16
;       uint InputTextureOffset;                      ; Offset:   20
;       uint FilterTextureOffset;                     ; Offset:   24
;       uint OutputTextureOffset;                     ; Offset:   28
;       uint FBufferOffset;                           ; Offset:   32
;       uint FBufferInverseOffset;                    ; Offset:   36
;   
;   } cb0;                                            ; Offset:    0 Size:    40
;
; }
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxcoob 1.8.2306.4 (3e105849c)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !42, globals: !127)
!1 = !DIFile(filename: "./FFT_ConvWithTexture.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !16, !25, !8, !33, !34}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 137, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 95, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 95, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t2", file: !1, line: 138, baseType: !17)
!17 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<half, 2>", file: !1, line: 138, size: 32, align: 16, elements: !18, templateParams: !22)
!18 = !{!19, !21}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !17, file: !1, line: 138, baseType: !20, size: 16, align: 16, flags: DIFlagPublic)
!20 = !DIBasicType(name: "half", size: 16, align: 16, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !17, file: !1, line: 138, baseType: !20, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!22 = !{!23, !24}
!23 = !DITemplateTypeParameter(name: "element", type: !20)
!24 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 8, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 8, size: 64, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, line: 8, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, line: 8, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!31 = !{!32, !24}
!32 = !DITemplateTypeParameter(name: "element", type: !29)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float16_t", file: !1, line: 327, baseType: !20)
!34 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint4", file: !1, line: 766, baseType: !35)
!35 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 4>", file: !1, line: 766, size: 128, align: 32, elements: !36, templateParams: !41)
!36 = !{!37, !38, !39, !40}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !35, file: !1, line: 766, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !35, file: !1, line: 766, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !35, file: !1, line: 766, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !35, file: !1, line: 766, baseType: !29, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!41 = !{!32, !14}
!42 = !{!43, !54, !64, !68, !71, !74, !77, !78, !86, !89, !94, !97, !100, !103, !106, !121, !124}
!43 = !DISubprogram(name: "GSConvolutionWithTextureCS", scope: !1, file: !1, line: 93, type: !44, isLocal: false, isDefinition: true, scopeLine: 94, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @GSConvolutionWithTextureCS)
!44 = !DISubroutineType(types: !45)
!45 = !{null, !46, !46}
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 329, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 329, size: 96, align: 32, elements: !48, templateParams: !52)
!48 = !{!49, !50, !51}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !47, file: !1, line: 329, baseType: !29, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !47, file: !1, line: 329, baseType: !29, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !47, file: !1, line: 329, baseType: !29, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !{!32, !53}
!53 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!54 = !DISubprogram(name: "CopyFilterTextureToFilterBuffer", linkageName: "\01?CopyFilterTextureToFilterBuffer@@YAXY11BA@$$CAV?$vector@$f16@$01@@_NIIII@Z", scope: !1, file: !1, line: 23, type: !55, isLocal: false, isDefinition: true, scopeLine: 24, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{null, !57, !62, !63, !63, !63, !63}
!57 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !58)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 1024, align: 16, elements: !59)
!59 = !{!60, !61}
!60 = !DISubrange(count: 2)
!61 = !DISubrange(count: 16)
!62 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!63 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 10, baseType: !29)
!64 = !DISubprogram(name: "CopyDataSrcWindowToLocal", linkageName: "\01?CopyDataSrcWindowToLocal@@YAXY11BA@$$CAV?$vector@$f16@$01@@_NIIIV?$vector@I$01@@2@Z", scope: !65, file: !65, line: 17, type: !66, isLocal: false, isDefinition: true, scopeLine: 18, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DIFile(filename: "./FFT_Common.hlsl", directory: "")
!66 = !DISubroutineType(types: !67)
!67 = !{null, !57, !62, !63, !63, !63, !25, !25}
!68 = !DISubprogram(name: "GroupSharedTCFFT", linkageName: "\01?GroupSharedTCFFT@@YAX_NY11BA@$$CAV?$vector@$f16@$01@@II@Z", scope: !65, file: !65, line: 527, type: !69, isLocal: false, isDefinition: true, scopeLine: 528, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{null, !62, !57, !63, !63}
!71 = !DISubprogram(name: "Scale", linkageName: "\01?Scale@@YAXY11BA@$$CAV?$vector@$f16@$01@@M@Z", scope: !65, file: !65, line: 133, type: !72, isLocal: false, isDefinition: true, scopeLine: 134, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{null, !57, !8}
!74 = !DISubprogram(name: "ForwardScale", linkageName: "\01?ForwardScale@@YAMI@Z", scope: !65, file: !65, line: 115, type: !75, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!8, !63}
!77 = !DISubprogram(name: "InverseScale", linkageName: "\01?InverseScale@@YAMI@Z", scope: !65, file: !65, line: 124, type: !75, isLocal: false, isDefinition: true, scopeLine: 125, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubprogram(name: "GroupSharedTCFFT", linkageName: "\01?GroupSharedTCFFT@@YAX_NY0BA@$$CAV?$vector@$f16@$01@@II@Z", scope: !65, file: !65, line: 336, type: !79, isLocal: false, isDefinition: true, scopeLine: 337, flags: DIFlagPrototyped, isOptimized: false)
!79 = !DISubroutineType(types: !80)
!80 = !{null, !81, !82, !85, !85}
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !62)
!82 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_array_type, baseType: !16, size: 512, align: 16, elements: !84)
!84 = !{!61}
!85 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !63)
!86 = !DISubprogram(name: "Radix16FFT", linkageName: "\01?Radix16FFT@@YAX_NY0BA@$$CAV?$vector@$f16@$01@@@Z", scope: !65, file: !65, line: 241, type: !87, isLocal: false, isDefinition: true, scopeLine: 242, flags: DIFlagPrototyped, isOptimized: false)
!87 = !DISubroutineType(types: !88)
!88 = !{null, !62, !82}
!89 = !DISubprogram(name: "Radix8FFT", linkageName: "\01?Radix8FFT@@YAX_NAIAV?$vector@$f16@$01@@1111111@Z", scope: !65, file: !65, line: 184, type: !90, isLocal: false, isDefinition: true, scopeLine: 185, flags: DIFlagPrototyped, isOptimized: false)
!90 = !DISubroutineType(types: !91)
!91 = !{null, !62, !92, !92, !92, !92, !92, !92, !92, !92}
!92 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !93)
!93 = !DIDerivedType(tag: DW_TAG_reference_type, baseType: !16)
!94 = !DISubprogram(name: "Radix4FFT", linkageName: "\01?Radix4FFT@@YAX_NAIAV?$vector@$f16@$01@@111@Z", scope: !65, file: !65, line: 159, type: !95, isLocal: false, isDefinition: true, scopeLine: 160, flags: DIFlagPrototyped, isOptimized: false)
!95 = !DISubroutineType(types: !96)
!96 = !{null, !62, !92, !92, !92, !92}
!97 = !DISubprogram(name: "Radix2FFT", linkageName: "\01?Radix2FFT@@YAX_NAIAV?$vector@$f16@$01@@1@Z", scope: !65, file: !65, line: 154, type: !98, isLocal: false, isDefinition: true, scopeLine: 155, flags: DIFlagPrototyped, isOptimized: false)
!98 = !DISubroutineType(types: !99)
!99 = !{null, !62, !92, !92}
!100 = !DISubprogram(name: "ComplexMult", linkageName: "\01?ComplexMult@@YA?AV?$vector@$f16@$01@@V1@0@Z", scope: !65, file: !65, line: 150, type: !101, isLocal: false, isDefinition: true, scopeLine: 151, flags: DIFlagPrototyped, isOptimized: false)
!101 = !DISubroutineType(types: !102)
!102 = !{!16, !16, !16}
!103 = !DISubprogram(name: "ComplexMultTexture", linkageName: "\01?ComplexMultTexture@@YAX_N0Y11BA@V?$vector@$f16@$01@@Y11BA@$$CAV1@@Z", scope: !1, file: !1, line: 51, type: !104, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!104 = !DISubroutineType(types: !105)
!105 = !{null, !62, !62, !58, !57}
!106 = !DISubprogram(name: "GetKernelSum", linkageName: "\01?GetKernelSum@@YAXV?$Texture2D@V?$vector@M$03@@@@_NIY01$$CAV?$vector@M$01@@@Z", scope: !1, file: !1, line: 74, type: !107, isLocal: false, isDefinition: true, scopeLine: 75, flags: DIFlagPrototyped, isOptimized: false)
!107 = !DISubroutineType(types: !108)
!108 = !{null, !109, !62, !63, !112}
!109 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 95, size: 160, align: 32, elements: !2, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "element", type: !5)
!112 = !DIDerivedType(tag: DW_TAG_restrict_type, baseType: !113)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !114, size: 128, align: 32, elements: !120)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 180, baseType: !115)
!115 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 180, size: 64, align: 32, elements: !116, templateParams: !119)
!116 = !{!117, !118}
!117 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !115, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !115, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!119 = !{!13, !24}
!120 = !{!60}
!121 = !DISubprogram(name: "CopyDataLocalToDstWindow", linkageName: "\01?CopyDataLocalToDstWindow@@YAXY11BA@V?$vector@$f16@$01@@_NIIIV?$vector@I$01@@@Z", scope: !65, file: !65, line: 764, type: !122, isLocal: false, isDefinition: true, scopeLine: 765, flags: DIFlagPrototyped, isOptimized: false)
!122 = !DISubroutineType(types: !123)
!123 = !{null, !58, !62, !63, !63, !63, !25}
!124 = !DISubprogram(name: "CopyDataLocalToDstWindow", linkageName: "\01?CopyDataLocalToDstWindow@@YAXY11BA@V?$vector@$f16@$01@@_NIIIV?$vector@I$03@@@Z", scope: !65, file: !65, line: 730, type: !125, isLocal: false, isDefinition: true, scopeLine: 731, flags: DIFlagPrototyped, isOptimized: false)
!125 = !DISubroutineType(types: !126)
!126 = !{null, !58, !62, !63, !63, !63, !34}
!127 = !{!128, !130, !131, !132, !133, !134, !135, !136, !137, !141, !142, !143, !144, !145, !147, !148, !149, !150, !152}
!128 = !DIGlobalVariable(name: "SrcRectMax", linkageName: "\01?SrcRectMax@cb0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 8, type: !129, isLocal: false, isDefinition: true)
!129 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !25)
!130 = !DIGlobalVariable(name: "DstExtent", linkageName: "\01?DstExtent@cb0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 9, type: !129, isLocal: false, isDefinition: true)
!131 = !DIGlobalVariable(name: "TransformType", linkageName: "\01?TransformType@cb0@@3IB", scope: !0, file: !1, line: 10, type: !85, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariable(name: "InputTextureOffset", linkageName: "\01?InputTextureOffset@cb0@@3IB", scope: !0, file: !1, line: 11, type: !85, isLocal: false, isDefinition: true)
!133 = !DIGlobalVariable(name: "FilterTextureOffset", linkageName: "\01?FilterTextureOffset@cb0@@3IB", scope: !0, file: !1, line: 12, type: !85, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariable(name: "OutputTextureOffset", linkageName: "\01?OutputTextureOffset@cb0@@3IB", scope: !0, file: !1, line: 13, type: !85, isLocal: false, isDefinition: true)
!135 = !DIGlobalVariable(name: "FBufferOffset", linkageName: "\01?FBufferOffset@cb0@@3IB", scope: !0, file: !1, line: 14, type: !85, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariable(name: "FBufferInverseOffset", linkageName: "\01?FBufferInverseOffset@cb0@@3IB", scope: !0, file: !1, line: 15, type: !85, isLocal: false, isDefinition: true)
!137 = !DIGlobalVariable(name: "groupMatInput", linkageName: "\01?groupMatInput@@3PA$f16@A", scope: !0, file: !65, line: 327, type: !138, isLocal: false, isDefinition: true, variable: [8192 x half] addrspace(3)* @"\01?groupMatInput@@3PA$f16@A")
!138 = !DICompositeType(tag: DW_TAG_array_type, baseType: !33, size: 131072, align: 16, elements: !139)
!139 = !{!140}
!140 = !DISubrange(count: 8192)
!141 = !DIGlobalVariable(name: "groupMatOutput", linkageName: "\01?groupMatOutput@@3PA$f16@A", scope: !0, file: !65, line: 329, type: !138, isLocal: false, isDefinition: true, variable: [8192 x half] addrspace(3)* @"\01?groupMatOutput@@3PA$f16@A")
!142 = !DIGlobalVariable(name: "SignalLength", scope: !43, file: !1, line: 142, type: !85, isLocal: true, isDefinition: true)
!143 = !DIGlobalVariable(name: "Stride", scope: !43, file: !1, line: 147, type: !85, isLocal: true, isDefinition: true)
!144 = !DIGlobalVariable(name: "SrcRectMin", scope: !43, file: !1, line: 159, type: !129, isLocal: true, isDefinition: true)
!145 = !DIGlobalVariable(name: "PI", scope: !0, file: !65, line: 331, type: !146, isLocal: true, isDefinition: true)
!146 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!147 = !DIGlobalVariable(name: "groupsize", scope: !78, file: !65, line: 368, type: !85, isLocal: true, isDefinition: true)
!148 = !DIGlobalVariable(name: "finalMergeNum", scope: !78, file: !65, line: 369, type: !85, isLocal: true, isDefinition: true)
!149 = !DIGlobalVariable(name: "stride", scope: !78, file: !65, line: 470, type: !85, isLocal: true, isDefinition: true)
!150 = !DIGlobalVariable(name: "SrcRectMin.1", linkageName: "\01?SrcRectMin@?1??GSConvolutionWithTextureCS@@YAXV?$vector@I$02@@0@Z@3V?$vector@I$01@@B.1", scope: !43, file: !1, line: 159, type: !151, isLocal: false, isDefinition: true)
!151 = !DIDerivedType(tag: DW_TAG_member, name: ".1", baseType: !129, size: 32, align: 4, offset: 32)
!152 = !DIGlobalVariable(name: "SrcRectMin.0", linkageName: "\01?SrcRectMin@?1??GSConvolutionWithTextureCS@@YAXV?$vector@I$02@@0@Z@3V?$vector@I$01@@B.0", scope: !43, file: !1, line: 159, type: !153, isLocal: false, isDefinition: true)
!153 = !DIDerivedType(tag: DW_TAG_member, name: ".0", baseType: !129, size: 32, align: 4)
!154 = !{i32 2, !"Dwarf Version", i32 4}
!155 = !{i32 2, !"Debug Info Version", i32 3}
!156 = !{!"dxcoob 1.8.2306.4 (3e105849c)"}
